app/Controllers/page.php

    public function index()
    {
        $jadwalModel = new JadwalModel();
        $pendaftaranModel = new PendaftaranModel();

        $dataJadwal = $jadwalModel->orderBy('tanggal', 'ASC')->findAll(6);

        $userId = user_id();
        $daftarJadwalSaya = [];

        if ($userId) {
            $dataPendaftaran = $pendaftaranModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `jadwal`
ORDER BY `tanggal` ASC
 LIMIT 6
SELECT *
FROM `pendaftaran`
WHERE `user_id` = '4'

    public function materi()
    {
        $materiModel = new MateriModel();
        $progressModel = new UserProgressModel();

        $dataMateri = $materiModel->findAll();
        $userId = user_id();
        $progressData = [];

        if ($userId) {
            $userProgress = $progressModel
                                ->select('materi_id, COUNT(id) as completed')
                                ->where('user_id', $userId)
                                ->where('is_completed', 1)
                                ->groupBy('materi_id')
                                ->findAll();
---
SELECT *
FROM `materi`
SELECT `materi_id`, COUNT(id) as completed
FROM `user_progress`
WHERE `user_id` = '4'
AND `is_completed` = 1
GROUP BY `materi_id`

    public function profile()
    {


        $userId = user_id();
        $profileModel = new ProfileModel();
        $nilaiModel = new NilaiModel();
        $progressModel = new UserProgressModel();

        $userProfile = $profileModel->getProfile($userId);

        $totalPoinArr = $nilaiModel->where('user_id', $userId)->selectSum('skor')->first();
        $totalPoin = $totalPoinArr['skor'] ?? 0;

        $materiSelesai = $progressModel->where(['user_id' => $userId, 'is_completed' => 1])->countAllResults();
---
SELECT SUM(`skor`) AS `skor`
FROM `nilai`
WHERE `user_id` = '4'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `user_progress`
WHERE `user_id` = '4'
AND `is_completed` = 1

            $dataSimpan['id'] = $existingProfile['id'];
        }

        $profileModel->save($dataSimpan);
---
UPDATE `profiles` SET `user_id` = '4', `nama_lengkap` = 'giska', `nim` = '240302002', `kelas` = 'TI 2A', `prodi` = 'Teknik rekayasa manufkatur', `jurusan` = 'Sastra Mesin', `semester` = '1', `jenis_kelamin` = 'Laki-laki', `alamat` = 'Tegal', `foto` = '1764081127_c0fa8af26edc4c919332.jpg', `updated_at` = '2025-12-03 02:52:05'
WHERE `profiles`.`id` IN ('2')

    public function progres()
    {


        $userId = user_id();
        $progressModel = new UserProgressModel();
        $materiModel = new MateriModel();

        $totalSelesai = $progressModel->where(['user_id' => $userId, 'is_completed' => 1])->countAllResults();
        $totalJam = $totalSelesai * 2;

        $aktivitas = $progressModel->select('DATE(completed_at) as tanggal')
                                   ->where('user_id', $userId)
                                   ->groupBy('DATE(completed_at)')
                                   ->orderBy('tanggal', 'DESC')
                                   ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `user_progress`
WHERE `user_id` = '4'
AND `is_completed` = 1
SELECT DATE(completed_at) as tanggal
FROM `user_progress`
WHERE `user_id` = '4'
GROUP BY DATE(completed_at)
ORDER BY `tanggal` DESC

            }
        }

        $semuaMateri = $materiModel->findAll();
        $targetBulanan = [];

        foreach ($semuaMateri as $m) {
            $completedCount = $progressModel->where([
                'user_id' => $userId,
                'materi_id' => $m['id'],
                'is_completed' => 1
            ])->countAllResults();
---
SELECT *
FROM `materi`
SELECT COUNT(*) AS `numrows`
FROM `user_progress`
WHERE `user_id` = '4'
AND `materi_id` = '1'
AND `is_completed` = 1

            $startDate = date('Y-m-') . sprintf("%02d", $startDay);
            $endDate = date('Y-m-') . sprintf("%02d", $endDay);

            $count = $progressModel->where('user_id', $userId)
                                   ->where('completed_at >=', $startDate . ' 00:00:00')
                                   ->where('completed_at <=', $endDate . ' 23:59:59')
                                   ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user_progress`
WHERE `user_id` = '4'
AND `completed_at` >= '2025-12-01 00:00:00'
AND `completed_at` <= '2025-12-07 23:59:59'

    public function peringkat()
    {


        $db = \Config\Database::connect();

        $builder = $db->table('nilai');
        $builder->select('nilai.user_id, SUM(nilai.skor) as total_skor, profiles.nama_lengkap, profiles.jurusan, profiles.prodi');
        $builder->join('profiles', 'profiles.user_id = nilai.user_id', 'left');
        $builder->groupBy('nilai.user_id, profiles.nama_lengkap, profiles.jurusan, profiles.prodi');
        $builder->orderBy('total_skor', 'DESC');

        $query = $builder->get();
---
SELECT `nilai`.`user_id`, SUM(nilai.skor) as total_skor, `profiles`.`nama_lengkap`, `profiles`.`jurusan`, `profiles`.`prodi`
FROM `nilai`
LEFT JOIN `profiles` ON `profiles`.`user_id` = `nilai`.`user_id`
GROUP BY `nilai`.`user_id`, `profiles`.`nama_lengkap`, `profiles`.`jurusan`, `profiles`.`prodi`
ORDER BY `total_skor` DESC