app/Controllers/Page.php

SELECT *
FROM `jadwal`
ORDER BY `tanggal` ASC
 LIMIT 6
SELECT *
FROM `pendaftaran`
WHERE `user_id` = '2'
---
    public function index()
    {
        $jadwalModel = new JadwalModel();
        $pendaftaranModel = new PendaftaranModel();

        $dataJadwal = $jadwalModel->orderBy('tanggal', 'ASC')->findAll(6);

        $userId = user_id();
        $daftarJadwalSaya = [];

        if ($userId) {
            $dataPendaftaran = $pendaftaranModel->where('user_id', $userId)->findAll();